cats99/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update(strong_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "scruffyo"], ["description", "ubhji"], ["updated_at", "2023-02-19 21:17:10.929824"], ["id", 1]]